def t_data() -> list[tuple]:
    return [
        ('Иван', 'Иванов-Сергеев', '2000-12-15'),
        (
            (
                'ИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИванИва'),
            'И', '2000-12-15'),
        ('И',
         'Иванов-СергеевИванов-СергеевИванов-СергеевИванов-СергеевИванов-СергеевИванов-СергеевИванов-СергеевИванов-СергеевИванов-СергеевИванов-СергеевИванов-СергеевИванов-СергеевИванов-СергеевИванов-СергеевИванов-СергеевИванов-СергеевИванов-СергеевИванов-СергеевИва',
         '2000-12-15'), ]
